БухЭксп/InformationRegisters/CW_СоответствиеСтатейДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СоответствиеСтатейДДС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СоответствиеСтатейДДС/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, Замещение)
	
	мСтатьиДвиженияДенежныхСредств =  Новый Массив;
	Для Каждого Строка Из ЭтотОбъект Цикл
		 мСтатьиДвиженияДенежныхСредств.Добавить(Строка.СтатьяДвиженияДенежныхСредств);
	КонецЦикла;
	
	ПроверитьДублиСтатейДДС(мСтатьиДвиженияДенежныхСредств, Отказ);
	
КонецПроцедуры

Процедура ПроверитьДублиСтатейДДС(мСтатьиДвиженияДенежныхСредств, Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СоответствиеСтатейДДС.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	               |	CW_СоответствиеСтатейДДС.СтатьяДДС КАК СтатьяДДС
	               |ИЗ
	               |	РегистрСведений.CW_СоответствиеСтатейДДС КАК CW_СоответствиеСтатейДДС
	               |ГДЕ
	               |	CW_СоответствиеСтатейДДС.СтатьяДвиженияДенежныхСредств В(&мСтатьиДвиженияДенежныхСредств)";
	
	Запрос.УстановитьПараметр("мСтатьиДвиженияДенежныхСредств", мСтатьиДвиженияДенежныхСредств);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ШаблонСообщения = "Статья движения денежных средств уже назначена для Статьи %1";
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.СтатьяДДС);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"СтатьяДвиженияДенежныхСредств","Запись",Отказ);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


#КонецЕсли
